---
layout: blog-post
title: Intro to Redis
category: blog
tags: [redis]
short_url: mig.gs/6XUE
description: Simple explanations of Redis data structures.
---
<p><a href="http://redis.io/" target="_blank"><strong>Redis</strong></a> is an in-memory, key-value store that is fast. <em>Really fast</em>. Redis can hold hundreds of millions of keys in memory and handle tens of thousands of requests per second without breaking a sweat. It's useful for caching data, maintaining sessions, keeping counters, queues, publish/subscribe real time notifications, and so on. There are many use cases for Redis due to it's simple dictionary model that maps keys to values, but what one should be aware of is that it's focus is <em>not</em> long-term data persistance. The whole Redis database is loaded into memory so there is a chance of data loss due to the fact that Redis first stores new entries in memory and then writes it to disk in the background after a certain period of time or amount of new keys have been accumulated. For example, if there were to be a power failure you could potentially lose a minute or two worth of data, which can or may not be fatal depending on your application. Of course, you can configure the threshold to something more comfortable which I will go over later.</p>

<p>The majority of this post will be going over some of the data structures that Redis provides, such as <strong>keys</strong>, <strong>hashes</strong>, <strong>lists</strong>, and <strong>sets</strong>. Redis isn't meant to be an <em>all-in-one</em> database replacement. It has it's niche, it's simple and it can do certain <em>really</em> well. If you haven't already, I strongly suggest you read the <a href="http://redis.io/topics/data-types-intro" target="_blank">15 minute intro to Redis data types</a> on the Redis site. I'll also talk about sorting, multi-commands, and monitoring.</p>

<p>It would be wrong if I didn't give credit to <a href="http://openmymind.net/2012/1/23/The-Little-Redis-Book/" target="_blank">The Little Redis Book</a> by <a href="http://openmymind.net/" target="_blank">Karl Seguin</a> for helping me gain a lot of the information on Redis. It's definitely a good read and great resource.</p>

<h2>Installation</h2>

<p><a href="http://redis.io/topics/quickstart" target="_blank">The Redis quickstart guide</a> is good place to start. Installing Redis is straight forward. <a href="http://redis.io/download" target="_blank">Download</a> the tarball, extract, and run <code>make</code>. If you're on a Mac you can simply do <code>brew install redis</code> with <a href="http://brew.sh/" target="_blank">Homebrew</a>.

<p>After installation, start a redis instance with</p>

{% highlight bash %}
redis-server {path to redis.conf}
{% endhighlight %}

<p>and then fire up the command line client</p>

{% highlight bash %}
redis-cli -p {port}
{% endhighlight %}

<p>For the rest of the post we'll be working from the command-line interface.</p>

<h2>Keys</h2>

<p>Keys can hold a single value, wether it be a string or numeric value. We create a key with the <code>set</code> command</p>

{% highlight bash %}
> set foo bar 
OK
{% endhighlight %}

<p>Retreive a key with the <code>get</code> command</p>

{% highlight bash %}
> get foo
"bar"
{% endhighlight %}

<p>Delete a key with <code>del</code></p>

{% highlight bash %}
> del foo
(integer) 1
> get foo
(nil)
{% endhighlight %}

<p>Store a JSON string</p>

{% highlight bash %}
> set users:foo "{name: foo, age: 21, hobbies: [baz, qux]}"
OK
> get users:foo
"{name: foo, age: 21, hobbies: [baz, qux]}"
{% endhighlight %}

<p>Notice the colon in the key. The colon is just part of the key name, it doesn't have any special meaning to Redis. It's purpose is to visually group a set of related keys together.</p>

<p>If the value is a number you can incremented with the <code>incr</code > or <code>incrby</code> command. If the key doesn't exist it will simply create it</p>

{% highlight bash %}
> incr stats:views  
(integer) 1
> incr stats:views  
(integer) 2
> incrby stats:views 5
(integer) 7
{% endhighlight %}

<h2>Hashes</h2>

<p>Hashes are </p>

hmset users:goku race saiyan age 737
hmget users:goku race powerlevel
hgetall users:goku
hkeys users:goku
hdel users:goku age

<h2>Lists</h2>

lpush newusers goku
ltrim newusers 0 49 # get top 50

<h2>Sets</h2>

sadd friends:leto ghanima paul chani jessica
sadd friends:duncan paul jessica alia
sismember friends:leto jessica # true
sismember friends:leto vladimir # false
sinter friends:leto friends:duncan # return a list of shared friends
sinterstore friends:leto_duncan friends:leto friends:duncan # store result
# sorted sets
zadd friends:duncan 70 ghanima 95 paul 95 chani 75 jessica 1 vladimir # the number is rank
zcount friends:duncan 90 100 # count of top rank
zrevrank friends:duncan chani # get list rank. hight to low

# users
set users:9001 ”{id: 9001, email: leto@dune.gov, ...}”
hset users:lookup:email leto@dune.gov 9001
get users:9001
# ruby - get user by email
id = redis.hget(’users:lookup:email’, ’leto@dune.gov’)
user = redis.get(”users:#{id}”)

# sorting
rpush users:leto:guesses 5 9 10 2 4 10 19 2
sort users:leto:guesses
sadd friends:ghanima leto paul chani jessica alia duncan
sort friends:ghanima limit 0 3 desc alpha

# sort by severity example
sadd watch:leto 12339 1382 338 9338
set severity:12339 3
set severity:1382 2
set severity:338 5
set severity:9338 4
sort watch:leto by severity:* desc

# another example
hset bug:12339 severity 3
hset bug:12339 priority 1
hset bug:12339 details ”{id: 12339, ....}”
hset bug:1382 severity 2
hset bug:1382 priority 2
hset bug:1382 details ”{id: 1382, ....}”

sort watch:leto by bug:*->priority get bug:*->details
# store result
sort watch:leto by bug:*->priority get bug:*->details store watch_by_priority:leto


# scan
scan 0 match bugs:* count 2
> 1) ”3”
> 2) 1) ”bugs:125”
scan 3 match bugs:* count 2 # scan 3 because of previous next cursor
> 1) ”0” # 0 means end
> 2) 1) ”bugs:124”


# pipelining can really speed up a batch import
redis.pipelined do
9001.times do
redis.incr(’powerlevel’)
end

# queue - multi commands
multi
hincrby groups:1percent balance -9000000000
hincrby groups:99percent balance 9000000000
exec # or do 'discard'

# multi - in ruby
redis.watch(’powerlevel’)
current = redis.get(’powerlevel’)
redis.multi()
17
redis.set(’powerlevel’, current + 1)
redis.exec()

# don't use keys because it's slow
keys bug:1233:* # don't do this
# instead us hashes
hset bugs:1233 1 ”{id:1, account: 1233, subject: ’...’}”
hset bugs:1233 2 ”{id:2, account: 1233, subject: ’...’}”

# clear database
flushdb
# clear all databases
flushall

# select database
select 1

# expiration
expire pages:about 30 # 30 seconds
expireat pages:about 1356933600 # 12:00a.m. December 31st, 2012.
ttl pages:about # view time to live
persist pages:about # remove expiration

# subscribe
subscribe warnings # do this in one redis-cli window (can subscribe to multiple channels)
publish warnings ”it’s over 9000!” # do this in another window

# monitor
monitor
# recent logs
config set slowlog-log-slower-than 0
slowlog get
slowlog get 10
# everything related to loging
config get *log*

<h2>Conclusion</h2>
