---
layout: blog-post
title: Intro to Redis
category: blog
tags: [Redis, CLI]
short_url: mig.gs/6XUE
description: Simple explanations of Redis data structures.
---
<p><a href="http://redis.io/" target="_blank"><strong>Redis</strong></a> is an in-memory, key-value store that is fast. <em>Really fast</em>. Redis can hold hundreds of millions of keys in memory and handle tens of thousands of requests per second without breaking a sweat. It's useful for caching data, maintaining sessions, keeping counters, queues, publish/subscribe real time notifications, and so on. There are many use cases for Redis due to it's simple dictionary model that maps keys to values, but what one should be aware of is that it's focus is <em>not</em> long-term data persistance. The whole Redis database is loaded into memory so there is a chance of data loss due to the fact that Redis first stores new entries in memory and then writes it to disk in the background after a certain period of time or amount of new keys have been accumulated. For example, if there were to be a power failure you could potentially lose a minute or two worth of data, which can or may not be fatal depending on your application. Of course, you can configure the threshold to something more comfortable which I will go over later.</p>

<p>The majority of this post will be going over some of the data structures that Redis provides, such as <strong>keys</strong>, <strong>hashes</strong>, <strong>lists</strong>, and <strong>sets</strong>. Redis isn't meant to be an <em>all-in-one</em> database replacement. It has it's niche, it's simple and it can do certain <em>really</em> well. If you haven't already, I strongly suggest you read the <a href="http://redis.io/topics/data-types-intro" target="_blank">15 minute intro to Redis data types</a> on the Redis site. I'll also talk about sorting, multi-commands, and monitoring.</p>

<p>I would like to give credit to <a href="http://openmymind.net/2012/1/23/The-Little-Redis-Book/" target="_blank">The Little Redis Book</a> by <a href="http://openmymind.net/" target="_blank">Karl Seguin</a> for helping me gain a lot of the information on Redis and some the example I show below. It's definitely a good read and great resource.</p>

<h2>Installation</h2>

<p><a href="http://redis.io/topics/quickstart" target="_blank">The Redis quickstart guide</a> is good place to start. Installing Redis is straight forward. <a href="http://redis.io/download" target="_blank">Download</a> the tarball, extract, and run <code>make</code>. If you're on a Mac you can simply do <code>brew install redis</code> with <a href="http://brew.sh/" target="_blank">Homebrew</a>.

<p>After installation, start a redis instance with</p>

{% highlight bash %}
redis-server {path to redis.conf}
{% endhighlight %}

<p>and then fire up the command line client</p>

{% highlight bash %}
redis-cli -p {port}
{% endhighlight %}

<p>For the rest of the post we'll be working from the command-line interface.</p>

<h2>Keys</h2>

<p>Keys can hold a single value, wether it be a string or numeric value. We create a key with the <code>set</code> command</p>

{% highlight bash %}
> set foo bar 
OK
{% endhighlight %}

<p>Retreive a key with the <code>get</code> command</p>

{% highlight bash %}
> get foo
"bar"
{% endhighlight %}

<p>Delete a key with <code>del</code></p>

{% highlight bash %}
> del foo
(integer) 1
> get foo
(nil)
{% endhighlight %}

<p>Store a JSON string</p>

{% highlight bash %}
> set users:foo "{name: foo, age: 21, hobbies: [baz, qux]}"
OK
> get users:foo
"{name: foo, age: 21, hobbies: [baz, qux]}"
{% endhighlight %}

<p>Notice the colon in the key. The colon is just part of the key name, it doesn't have any special meaning to Redis. It's purpose is to visually group a set of related keys together.</p>

<p>If the value is a number you can incremented with the <code>incr</code > or <code>incrby</code> command. If the key doesn't exist it will simply create it</p>

{% highlight bash %}
> incr stats:views  
(integer) 1
> incr stats:views  
(integer) 2
> incrby stats:views 5
(integer) 7
{% endhighlight %}

<h2>Hashes</h2>

<p>You can think of hashes a being a key-value pair, except that the value can be <em>multiple</em> key-value pairs. For example we can have a users hash that has multiple fields about the user.</p>

{% highlight bash %}
> hmset users:foo name "Foo" email foo@bar.com age 21
OK
> hmget users:foo email
1) "foo@bar.com"
> hmget users:foo email name
1) "foo@bar.com"
2) "Foo"
> hgetall users:foo
1) "email"
2) "foo@bar.com"
3) "age"
4) "21"
5) "name"
6) "Foo"
> hkeys users:foo
1) "email"
2) "age"
3) "name"
> hdel users:foo age
(integer) 1
> hset users:foo hobies [bar,qux]
(integer) 1
> hgetall users:foo
1) "email"
2) "foo@bar.com"
3) "name"
4) "Foo"
5) "hobies"
6) "[bar,qux]"
{% endhighlight %}

<p>Quick overview of hash commands:</p>

<p>
<code>hmset</code>: set a hash<br>
<code>hmget</code>: get a value from key<br>
<code>hmgetall</code>: get all keys and values<br>
<code>hkeys</code>: get all keys<br>
<code>hdel</code>: delete a key<br>
<code>hset</code>: set a key and value<br>
<code>hmset</code>: set multiple key and value pairs<br>
</p>

<p>Here's an example of way to do quick lookups for a user</p>

{% highlight bash %}
> set users:1000 "{id: 1000, email: foo@bar.com}"
OK
> hset users:lookup:email foo@bar.com 1000
(integer) 1
> hget users:lookup:email foo@bar.com
"1000"
> get users:1000
"{id: 1000, email: foo@bar.com}"
{% endhighlight %}

<h2>Lists</h2>

<p>A list is a list of strings. Push items into a list with <code>lpush</code></p>

{% highlight bash %}
> lpush newusers foo
(integer) 1
> lpush newusers bar
(integer) 2
{% endhighlight %}

<p>Use <code>lrange</code> to return a range</p>

{% highlight bash %}
> lrange newusers 0 -1
1) "bar"
2) "foo"
{% endhighlight %}

<p>A list can be sorted using the <code>sort</code> command</p>

{% highlight bash %}
> rpush users:foo:guesses 5 9 10 2 4 10 19 2
(integer) 8
> sort users:foo:guesses
1) "2"
2) "2"
3) "4"
4) "5"
5) "9"
6) "10"
7) "10"
8) "19"
{% endhighlight %}

<p>Keep the list trim n tidy with <code>ltrim</code>. For example, if we wanted to only keep a list of the latest 50 new users</p>

{% highlight bash %}
> ltrim newusers 0 49
OK
{% endhighlight %}

<h2>Sets</h2>

<p>Sets are undorered collection of strings. A use case for sets would be keeping a collection of a user's friends. To add to a set use <code>sadd</code></p>

{% highlight bash %}
> sadd friends:foo bar baz qux 
(integer) 3
> sadd friends:dexter bar qux deedee
(integer) 3
{% endhighlight %}

<p>We can check if a member belongs to a set with <code>sismember</code></p>

{% highlight bash %}
> sismember friends:foo bob
(integer) 0
> sismember friends:dexter deedee
(integer) 1
{% endhighlight %}

<p>With the <code>sinter</code> command we can return a list of members that <em>intersect</em> between sets. For example, if we wanted a list containing shared friends</p>

{% highlight bash %}
> sinter friends:foo friends:dexter
1) "bar"
2) "qux"
{% endhighlight %}

<p>We can also store the result into a new set with <code>sinterstore</code></p>

{% highlight bash %}
> sinterstore friends:foo_dexter friends:foo friends:dexter
(integer) 2
{% endhighlight %}

<p>Finally we can get members of a set with <code>smembers</code>

{% highlight bash %}
> smembers friends:foo_dexter
1) "bar" 
2) "qux" 
{% endhighlight %}

<p>It is also possible to sort sets. For example, having a set containing quiz scores</p>

{% highlight bash %}
> zadd students:foo 70 quiz1 95 quiz2 60 quiz3 99 quiz4 20 quiz5
(integer) 5
{% endhighlight %}

<p>We then get a count of scores between a range with <code>zcount</code></p>

{% highlight bash %}
> zcount students:foo 90 100
(integer) 2
{% endhighlight %}

<p>To determine the rank of a member within the set we can use <code>zrank</code> (low to high) or <code>zrevrank</code> (high to low)</p>

{% highlight bash %}
> zrank students:foo quiz3
(integer) 4
> zrevrank students:foo quiz3
(integer) 0
> zrevrank students:foo quiz1
(integer) 2
> zrevrank students:foo quiz2
(integer) 1
{% endhighlight %}

<p>Sort by name descending alphabetically</p>

{% highlight bash %}
> sadd friends:foo bar baz qux dexter deedee 
(integer) 5
> sort friends:foo limit 0 3 desc alpha
1) "qux"
2) "dexter"
3) "deedee"
{% endhighlight %}

<h2>Expiration</h2>

<p>Keys can be set to expire (delete) after a number of seconds. We do this with the <code>expire</code> or <code>expireat</code> commands. <code>ttl</code> returns the Time To Live and <code>persist</code> removes the expiration</p>

{% highlight bash %}
> incr views
(integer) 1
> expire views 30
(integer) 1
> ttl views
(integer) 30
> expireat views 1420005600 # expire on 12:00a.m. December 31st, 2014.
(integer) 0
> ttl views
(integer) 28529193
> persist views
(integer) -1
{% endhighlight %}

<h2>Flush</h2>

<p>Select database to use with <code>select</code> command</p>

{% highlight bash %}
> select 1
OK
{% endhighlight %}

<p>Clear current database with <code>flushdb</code></p>

{% highlight bash %}
> flushdb
OK
{% endhighlight %}

<p>Clear all databases with <code>flushall</code></p>

{% highlight bash %}
> flushall
OK
{% endhighlight %}

<h2>Subscribe / Publish</h2>

<p>With redis you can have subscribers listen to a channel. Publishing a message will be received by all subscribers in the channel. You can subscribe to multiple channels as well</p>

{% highlight bash %}
> subscribe greeetings
{% endhighlight %}

{% highlight bash %}
> publish greetings "Hello, World"
{% endhighlight %}

<p>Anyone subscried to the greetings channel will receive the "Hello, World" message.</p>

<h2>Multi</h2>

<p>The <code>multi</code> command let's us queue commands (transaction block) and then execute with <code>exec</code> or discard the queue with <code>discard</code></p>

{% highlight bash %}
> multi
OK
> incrby counter 10
QUEUED
> incrby counter -10 
QUEUED
> exec
1) (integer) 10
2) (integer) 0
{% endhighlight %}

<p>Queued commands will always execute in the order they were set, so a use case for using the multi command would be when a command is dependent on the result of the previous command</p>

<h2>Monitor</h2>

<p>Watch incomming redis commands with <code>monitor</code></p>

{% highlight bash %}
> monitor
OK
{% endhighlight %}

<p>Get recent logs</p>

{% highlight bash %}
> config set slowlog-log-slower-than 0
OK
> slowlog get 2
{% endhighlight %}

<p>Get config related to logging</p>

{% highlight bash %}
> config get *log*
{% endhighlight %}

<!--
<h2>More examples</h2>

<p>Sort by severity example</p>

{% highlight bash %}
> sadd watch:foo 12339 1382 338 9338
(integer) 4
> set severity:12339 3
OK
> set severity:1382 2
OK
> set severity:338 5
OK
> set severity:9338 4
sort watch:leto by severity:* desc
1) "338"
2) "9338"
3) "12339"
4) "1382"
{% endhighlight %}

<p>Another example</p>

{% highlight bash %}
hset bug:12339 severity 3
hset bug:12339 priority 1
hset bug:12339 details ”{id: 12339, ....}”
hset bug:1382 severity 2
hset bug:1382 priority 2
hset bug:1382 details ”{id: 1382, ....}”
{% endhighlight %}

{% highlight bash %}
sort watch:leto by bug:*->priority get bug:*->details
# store result
sort watch:leto by bug:*->priority get bug:*->details store watch_by_priority:leto
{% endhighlight %}

{% highlight bash %}
# don't use keys because it's slow
keys bug:1233:* # don't do this
# instead us hashes
hset bugs:1233 1 ”{id:1, account: 1233, subject: ’...’}”
hset bugs:1233 2 ”{id:2, account: 1233, subject: ’...’}”
{% endhighlight %}

<h2>Scan</h2>

{% highlight bash %}
scan 0 match bugs:* count 2
> 1) ”3”
> 2) 1) ”bugs:125”
scan 3 match bugs:* count 2 # scan 3 because of previous next cursor
> 1) ”0” # 0 means end
> 2) 1) ”bugs:124”
{% endhighlight %}
-->

<h2>Conclusion</h2>

<p>Redis is an incredibly fast data store that does a few things <em>very</em> well. Definitely worth checking out and incorporating it in your next project for an easy caching solution.</p>

<p>Resources</p>

<ul>
	<li><a href="http://openmymind.net/2012/1/23/The-Little-Redis-Book/" target="_blank">The Little Redis Book</a> by <a href="http://openmymind.net/" target="_blank">Karl Seguin</a></li>
	<li><a href="http://try.redis.io/" target="_blank">Try Redis</a></li>
</ul>
